app/views/restaurants/_form.html.erb

    <%= f.label :neighborhood %><br>
    <%= collection_select(:restaurant, :neighborhood_id, Neighborhood.all, :id, :name, include_blank: true) %><br>
---
SELECT "neighborhoods".* FROM "neighborhoods"

    <%= f.label :category %><br>
    <%= collection_check_boxes(:restaurant, :category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"