app/controllers/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 4]]

  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "street", "city", "state", "country", "postal_code", "neighborhood_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @restaurant = Restaurant.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 4]]

  def update
    @restaurant = Restaurant.find_by_id(params[:id])

    if @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "restaurants" SET "neighborhood_id" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["neighborhood_id", 2], ["updated_at", "2016-05-15 17:15:29.560139"], ["id", 1]]

  def destroy
    @restaurant = Restaurant.find_by_id(params[:id])
    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 11]]